Revit 2024 API
PathOfTravel.UpdateMultiple Method
Overload List
Name | Description
UpdateMultiple(Document, IList<ElementId>)
 Updates the specified paths of travel by recalculating each path using their original start and end points.
UpdateMultiple(Document, IList<ElementId>, IList<PathOfTravelCalculationStatus>)
 Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses.
See Also
PathOfTravel Class
PathOfTravel Members
Autodesk.Revit.DB.Analysis Namespace